import math
rad = int(input("Введите радиус круга: "))
#находим это самое длину площадку
l = 2*math.pi*rad
s = math.pi*(rad**2)
print(l," - длина окружности в сантиметрах; ",l/100," - длина окружности в метрах; ",s," - площадь окружности в сантиметрах квадратных; " ,s/10000," - площадь окружности в метрах квадратных;")
#находим сторону вписанного квадрата и треугольника
st_kv_vpis = 2*rad
st_tr_vpis = 6*rad/(3**0.5)
print(st_kv_vpis," - длина стороны вписанного квадрата в сантиметрах; ",st_kv_vpis/100," - длина стороны вписанного квадрата в метрах; ",st_tr_vpis," - длина стороны вписанного треугольника в сантиметрах квадратных; " ,st_tr_vpis/100," - длина стороны вписанного треугольника в метрах квадратных; ")
#находим сторону описанного квадрата, треугольника и восьмиугольника
st_kv_opis = 2*rad/(2**0.5)
st_tr_opis = 3*rad/(3**0.5)
st_vosm_opis = 2*rad*((2**0.5)-1)
print(st_kv_opis," - длина стороны описанного квадрата в сантиметрах; ",st_kv_opis/100," - длина стороны описанного квадрата в метрах; ",st_tr_opis," - длина стороны описанного треугольника в сантиметрах; " ,st_tr_opis/100," - длина стороны описанного треугольника в метрах; ",st_vosm_opis, " - длина стороны описанного восьмиугольника в сантиметрах; ",st_vosm_opis/100," - длина стороны описанного восьмиугольника в сантиметрах; ")

